<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"6abc945b834ea0297cd6e1fc0db31ecddb5de3da3d31d23f4098e2682300216c","plan_job_ref":"Job Run Terraform plan in staging #228 at https://github.com/GSA-TTS/continuous-assessment-poc/actions/runs/14311198605","plan_out_hash":"6e5b12c08656dff1f9ae81a0a7c42c36dc1de547199a7ee5ef363834f2b8ac53","plan_hash":"ed69efb7178e4b5dc10463750095a8bb5c3b2ecbd5b21ec942846eaf6286662a","plan_text_format":"diff","version":"1.48.0"} -->
Terraform plan in __terraform__
With var files: `terraform/staging.tfvars`
<details>
<summary>Plan: 0 to add, 3 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # cloudfoundry_app.app will be updated in-place
!~  resource "cloudfoundry_app" "app" {
!~      created_at                  = "2024-12-26T21:38:47Z" -> (known after apply)
+       disk_quota                  = (known after apply)
+       health_check_type           = (known after apply)
!~      id                          = "************************************" -> (known after apply)
+       instances                   = (known after apply)
+       log_rate_limit_per_second   = (known after apply)
+       memory                      = (known after apply)
        name                        = "continuous_monitoring-staging"
+       readiness_health_check_type = (known after apply)
!~      routes                      = [
-           {
-               protocol = "http1" -> null
-               route    = "continuous_monitoring-staging.app.cloud.gov" -> null
            },
        ] -> (known after apply)
!~      source_code_hash            = "8K4skVfzf9tkny3Kv4x3KtpPCDH3vFgop2mfoAM71YY=" -> "8d3UcxGMZ/5CWQP7DiC4+bu4JMbPXf81mSE8ZPp+YFY="
!~      stack                       = "cflinuxfs4" -> (known after apply)
!~      updated_at                  = "2025-03-27T21:03:33Z" -> (known after apply)
#        (8 unchanged attributes hidden)
    }

  # cloudfoundry_network_policy.egress_routing will be updated in-place
!~  resource "cloudfoundry_network_policy" "egress_routing" {
        id = "05a74ebf-eccc-3593-abce-90c94c007b39"

-       policy {
-           destination_app = "b7becb44-b1cd-412a-8d0a-ff01e55044b5" -> null
-           port            = "61443" -> null
-           protocol        = "tcp" -> null
-           source_app      = "99121ff6-67ff-485d-bf03-d92ed152bf51" -> null
        }
-       policy {
-           destination_app = "b7becb44-b1cd-412a-8d0a-ff01e55044b5" -> null
-           port            = "8080" -> null
-           protocol        = "tcp" -> null
-           source_app      = "99121ff6-67ff-485d-bf03-d92ed152bf51" -> null
        }
+       policy {
+           destination_app = "b7becb44-b1cd-412a-8d0a-ff01e55044b5"
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = (known after apply)
        }
+       policy {
+           destination_app = "b7becb44-b1cd-412a-8d0a-ff01e55044b5"
+           port            = "8080"
+           protocol        = "tcp"
+           source_app      = (known after apply)
        }
    }

  # module.app_route[0].cloudfoundry_route.app_route will be updated in-place
!~  resource "cloudfoundry_route" "app_route" {
!~      destinations = [
-           {
-               app_id           = "99121ff6-67ff-485d-bf03-d92ed152bf51" -> null
-               app_process_type = "web" -> null
-               id               = "0d27950c-8f56-46e2-b81f-91531067b6c6" -> null
-               port             = 8080 -> null
-               protocol         = "http1" -> null
            },
+           {
+               app_id           = (known after apply)
+               app_process_type = (known after apply)
+               id               = (known after apply)
+               port             = (known after apply)
+               protocol         = (known after apply)
            },
        ]
        id           = "97c72bbd-6eea-4c37-a138-7539079c5684"
!~      updated_at   = "2025-03-27T20:37:14Z" -> (known after apply)
#        (6 unchanged attributes hidden)
    }

Plan: 0 to add, 3 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Run Terraform plan in staging #228](https://github.com/GSA-TTS/continuous-assessment-poc/actions/runs/14311198605)